# EmptyPropertySetName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PropertySetElementFailures..::..EmptyPropertySetName Property
BuiltInFailures..::..PropertySetElementFailures Class See Also
---
A property set name cannot be an empty string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EmptyPropertySetName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EmptyPropertySetName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EmptyPropertySetName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PropertySetElementFailures Class
Autodesk.Revit.DB Namespace